VamsiKrishna80/Embedded-System-Programming-Course/STM32 board problems/SWITCH LED set1/8 SWITCH LED.c
/*
Press 0th switch 7th LED should glow ....
Press 1st switch 6th LED should glow .....
...........up to 7th switch
*/

#include"STM32F407VGT6_GPIO.h"
void delay()                      //delay function
{
volatile uint32_t count=1000000;
while(--count);
}
int main(void)
{
	volatile  uint32_t *pGPIOclken=(uint32_t*)0x40023830;   //Intializing the RCC AHB1ENB register
	GPIO_R *GPIOA =  ((GPIO_R*)0X40020000);                 //Intializing the GPIOA port
	GPIO_R *GPIOD =  ((GPIO_R*)0X40020C00);                 //Intializing the GPIOD port

	*pGPIOclken|=(1<<0);                                    //Enabling CLOCK to the GPIO port A
	*pGPIOclken|=(1<<3);                                    //Enabling CLOCK to the GPIO port D

	    // Configure PA0-PA7 as output (for LEDs)
	    GPIOA->MODER &= ~(0x0000FFFF);  // Clear mode bits for PA0-PA7
	    GPIOA->MODER |=  (0x00005555);  // Set PA0-PA7 as output mode (01)

	    // Configure PD0-PD7 as input with pull-down resistors (for pushbuttons)
	    GPIOD->MODER &= ~(0x0000FFFF);  // Clear mode bits for PD0-PD7 (input mode: 00)
	    GPIOD->PUPDR &= ~(0x0000FFFF);  // Clear pull-up/pull-down bits
	    GPIOD->PUPDR |=  (0x0000AAAA);  // Set pull-down for PD0-PD7 (10 binary = 2

     uint16_t LED[]={0x00ff,0x007f,0x003f,0x001f,0x000f,0x0007,0x0003,0x0001};
    /* Loop forever */
     while(1)
     	{

    	     if((GPIOD->IDR & 0x0001)==0x0001)
    	      		{
    	      			delay();
    	      		for(uint8_t i=0;i<8;i++)
    	      		{
    	      		    GPIOA->ODR =LED[i];
    	      		     delay();
    	      		}
    	      		 GPIOA->ODR =0x0000;
    	      		}
    	     else if((GPIOD->IDR & 0x0002)==0x00002)
     		     		{
     		     			delay();
     		     		for(uint8_t i=1;i<8;i++)
     		     		{
     		     		    GPIOA->ODR =LED[i];
     		     		     delay();
     		     		}
     		     		 GPIOA->ODR =0x0000;
     		     		}
     		else if((GPIOD->IDR & 0x0004)==0x00004)
     		     		{
     		     			delay();
     		     		for(uint8_t i=2;i<8;i++)
     		     		{
     		     		    GPIOA->ODR =LED[i];
     		     		     delay();
     		     		}
     		     		 GPIOA->ODR =0x0000;
     		     		}
     		else if((GPIOD->IDR & 0x0008)==0x00008)
     		     		{
     		     			delay();
     		     		for(uint8_t i=3;i<8;i++)
     		     		{
     		     		    GPIOA->ODR =LED[i];
     		     		     delay();
     		     		}
     		     		 GPIOA->ODR =0x0000;
     		     		}
     		else if((GPIOD->IDR & 0x00010)==0x00010)
     		     		{
     		     			delay();
     		     		for(uint8_t i=4;i<8;i++)
     		     		{
     		     		    GPIOA->ODR =LED[i];
     		     		     delay();
     		     		}
     		     		 GPIOA->ODR =0x0000;
     		     		}
     		else if((GPIOD->IDR & 0x0020)==0x00020)
     		     		{
     		     			delay();
     		     		for(uint8_t i=5;i<8;i++)
     		     		{
     		     		    GPIOA->ODR =LED[i];
     		     		     delay();
     		     		}
     		     		 GPIOA->ODR =0x0000;
     		     		}
     		else if((GPIOD->IDR & 0x0040)==0x00040)
     		     		{
     		     			delay();
     		     		for(uint8_t i=6;i<8;i++)
     		     		{
     		     		    GPIOA->ODR =LED[i];
     		     		     delay();
     		     		}
     		     		 GPIOA->ODR =0x0000;
     		     		}
     		else if((GPIOD->IDR & 0x0080)==0x00080)
     		     		{
     		     			delay();
     		     		for(uint8_t i=7;i<8;i++)
     		     		{
     		     		    GPIOA->ODR =LED[i];
     		     		     delay();
     		     		}
     		     		 GPIOA->ODR =0x0000;
     		     		}
     	}
	for(;;);
}
